app/controllers/languages_controller.rb

SELECT * FROM "languages"
---

	# If no errors with parameters
	if @first && flash.empty?
      @languages = Language.all