app/controllers/letter_campaigns_controller.rb


	# If no errors with parameters
	if @first && flash.empty?
      @letter_campaigns = LetterCampaign.all
---
SELECT * FROM "letter_campaigns" WHERE (name='boscimani')